<!doctype html public "-//w3c//dtd html 4.0 transitional//en">
<html>
<head>
   <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
   <meta name="GENERATOR" content="Mozilla/4.76 [en] (X11; U; SunOS 5.8 sun4u) [Netscape]">
</head>
<body text="#000000" bgcolor="#90C2C3" link="#0000EE" vlink="#551A8B" alink="#FF0000">

<center>
<h1>
Betam&oslash;de om arkitektur af Mj&oslash;lnersystemet</h1></center>

<center><img SRC="../makesimple.jpg" NOSAVE height=42 width=91>
<br>Torsdag d.11.oktober 2001, kl.14.15</center>

<p>
<hr WIDTH="100%">
<p>Til stede: ESS,KFJ,HML,(MBE (fr&oslash;s beta)),MEJ,KSJ
<br>Referent: MEJ
<p>Dato for n&aelig;ste m&oslash;de: Torsdag d. 25. oktober 2001, kl. 14.15.
<h3>
Referat</h3>

<h4>
1. KFJ's sekvensdiagram for NewFragment</h4>
MEJ udleverede en h&aring;ndtegnet udgave af ESS's diagram, som var checket
og kompletteret v.h.a. betakoden.
<p><img SRC="KFJ_newFragment2.jpg" NOSAVE height=596 width=842>
<br>(<a href="KFJ_newFragment2.pdf">pdf</a>, <a href="KFJ_newFragment2.xml">xml</a>)
<p>Sekvensdiagrammet handler om at inds&aelig;tte en ny fragmentform, men
for at kunne det, skal man bruge en GroupEditor, s&aring; diagrammet starter
"et skridt l&aelig;ngere ude" med oprettelsen af GroupEditor.
<p>Refresh'et er s&aring;dan set godt nok, men sp&oslash;rgsm&aring;let
er, om der er flere observere, der griber den samme notification og derfor
ogs&aring; giver sig til at kalde frem til UpdateBrowser osv. Grov skitse
over filer/fragmenter vi fulgte for at finde ud af hvor det sker:
<ul>
<li>
mps/notifications.bet</li>

<li>
editor/private/fgObserverBody ...</li>

<li>
sifBrowserWindowExt: et stykke inde i partobjects i partobjects: "refreshGroup"-patternet
kalder UpdateBrowser</li>

<li>
->YmerInterface</li>

<li>
-> YmerBody: --UpdateBrowser--</li>
</ul>
HML: AddToUseGroups (i SourceBrowserBodyExt: --SelectFragmentGroup-- )
opdaterer ogs&aring; treeviewet med "brugte filer"
<p>Problemet med de mange updates kan reproduceres ved f&oslash;rst at
sige Copy Fragment Form og dern&aelig;st Paste Fragment Form.
<br>&nbsp;
<h4>
2. Navngivning i delm&aelig;ngden "Sif og Ymer"</h4>
I et fors&oslash;g p&aring; at lave uniform navngivning gennemgik vi Sif/editor-
og Ymer/sourcebrowser-klasserne for at finde ud af hvad de hver is&aelig;r
g&oslash;r. Fra nu af hedder Sif 'editor' og Ymer hedder 'sourcebrowser'.
Flg. b&oslash;r dog checkes med FGC f&oslash;r &aelig;ndringer s&aelig;ttes
i v&aelig;rk.
<ul>
<li>
SourceBrowser,YmerSourceBrowser og BrowserType er gui- (eller view-) delen
af sourcebrowser. De kan s&aring;ledes kaldes noget i retning af 'sbGui'.
Hvad adskiller dem?</li>

<li>
YmerBrowserInterface,YmerYmerBrowserInterface og YmerBrowserWindow er controller-delen
af sourcebrowser. De kan derfor respektivt kaldes SourceBrowserInterface,
SourceBrowserInterfaceImpl og SourceBrowserWindow.</li>

<li>
YmerEnvInterface, Yi og YmerEnv udg&oslash;r noget environment, som SourceBrowser
har brug for. Det kan kaldes sbEnvInterface, sbEnvInterfaceImpl og sbEnv.
(MEJ: hvorfor har env. brug for et interface (som f.eks. SifApplication
har en pointer til)?).</li>

<li>
SifInterface -> EditorInterface, ExternalInterface -> EditorInterfaceImpl,
SifApplication-> EditorApplication</li>
</ul>

<p><br>ESS: YmerCalls vigtigste funktion er at v&aelig;re CodeEditors interface
til sourcebrowser.
<br>&nbsp;
<h4>
3. HML om sammenl&aelig;gning af EditorEnv og SifBrowserWindowExt</h4>
<img SRC="editorcreation.jpg" height=287 width=606>
<br>(<a href="editorcreation.pdf">pdf</a>, <a href="editorcreation.xmi">xml</a>)
<p>F&oslash;rst en rettelse til Sif/Ymer-klassediagrammet fra d.28. sep.:
ExternalInterface er partobject i SifBrowserWindowExt og ikke i SifApplication.
<p>HMLs konklusion p&aring; unders&oslash;gelser: EditorEnv kan godt flyttes.
Men i stedet for at sl&aring; SifBrowserWindowExt og EditorEnv sammen,
er der mere brug for at rede ud hvordan SifBrowserWindowExt (SBWE) og SourceBrowser
(SB) interface'er til hinanden; tilsyneladende har SBWE brug for et interface
til SB, mens SB i mindre grad har brug for et interface til SBWE. SBWE
er Sif's m&aring;de at f&aring; adgang til SB, da det er her, YmerCall
er bundet.
<br>&nbsp;
<p><img SRC="editorenv.jpg" height=312 width=597>
<br>(<a href="editorenv.pdf">pdf</a>, <a href="editorenv.xml">xml</a>)
<br>&nbsp;
<h4>
4. Lektier</h4>
KFJ kigger n&aelig;rmere p&aring; detaljerne nede i denne dybde og fors&oslash;ger
at lokalisere multiple refreshes.
<br>MEJ f&aelig;rdigg&oslash;r forslag til navne&aelig;ndringer og checker
med FGC om det er koh&aelig;rent med klassernes egentlige brug.
<br>HML kigger mere p&aring; SifBrowserWindowExt og dens rolle i SifApplication
m.h.t. interfaces.
<br>&nbsp;
<br>&nbsp;
<br>&nbsp;
<br>&nbsp;
<br>&nbsp;
</body>
</html>
