<!doctype html public "-//w3c//dtd html 4.0 transitional//en">
<html>
<head>
   <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
   <meta name="GENERATOR" content="Mozilla/4.76 [en] (X11; U; SunOS 5.8 sun4u) [Netscape]">
</head>
<body text="#000000" bgcolor="#90C2C3" link="#0000EE" vlink="#551A8B" alink="#FF0000">

<center>
<h1>
Betam&oslash;de om arkitektur af Mj&oslash;lnersystemet</h1></center>

<center><img SRC="../makesimple.jpg" NOSAVE height=42 width=91>
<br>Fredag d.28.september 2001, kl.12.15</center>

<p>
<hr WIDTH="100%">
<p>Til stede: ESS,FGC,SOSH,KFJ,HML,MBE,MEJ,KSJ
<br>Referent: MEJ
<p>Dato for n&aelig;ste m&oslash;de: Torsdag d. 11. oktober 2001, kl. 14.15.
<p>Xml-filerne og tilh&oslash;rende PDF-print er lavet vha. Ideogramic
UML.
<h3>
Referat</h3>

<h4>
1. HML-gennemgang af klassediagram for Sif og Ymer</h4>
Fokus er forel&oslash;bigt begr&aelig;nset til Sif og Ymer for at &oslash;ge
overskueligheden.
<p><img SRC="HML_MjolnerCentralArki.jpg" height=443 width=786>
<br>(<a href="HML_MjolnerCentralArki.pdf">pdf</a> , <a href="HML_MjolnerCentralArki.xml">xml</a>)
<p>Det generelle indtryk er, at der b&oslash;r ryddes op i 'hvem', der
har referencer til hvem og hvordan disse referencer s&aelig;ttes op, samt
forsimpling af strukturen. De vigtigste umiddelbare &aelig;ndringsforslag:
<ul>
<li>
YmerBrowserInterface har en ukvalificeret window-reference til YmerBrowserWindow.
I stedet burde man g&oslash;re vinduet tilg&aelig;ngeligt gennem en 'getWindow'-metode</li>

<li>
EditorEnv ligger som --windowlib: attributes-- (dvs. som attribut i guienv.window)
for at kunne f&aring; fat i sit vindue, hvilket er lidt m&aelig;rkeligt.
I stedet kunne den have en reference til sit vindue?</li>

<li>
EditorEnv har noget vigtig Sif-funktionalitet. Hvorfor ikke g&oslash;re
dette tilg&aelig;ngeligt i SifInterface, s&aring; alle slipper for at have
en reference til EditorEnv (dvs. sl&aring; SifInterface og EditorEnv sammen)</li>

<li>
Mere simplificering: sl&aring; SifBrowserWindowExt og YmerCallback sammen</li>
</ul>
ESS (pr&aelig;cisering): 'Yi' binder de virtuelle i YmerEnvInterface
<p>FGC: det er v&aelig;rd at bevare strukturen "Sif har en statisk SifExternalInterface,
som arver fra SifInterface".
<p>MEJ: 'SifExternalInterface' er vildledende. Kunne i stedet hedde 'SifInterfaceImpl'
for at understrege, at den implementerer SifInterface.
<br>&nbsp;
<h4>
2. HML-gennemgang af sekvensdiagram for startup af Mj&oslash;lner</h4>
<img SRC="HML_Startup_seqDiag.jpg" height=507 width=684>
<br>(<a href="HML_Startup_seqDiag.pdf">pdf</a>, <a href="HML_Startup.xml">xml</a>)
<p>Form&aring;let er at se p&aring; hvordan referencerne mellem de forskellige
dele i applikationen bliver sat op.
<p>FGC: hvis r&aelig;kkef&oslash;lgen er m&aelig;rkelig, kan det skyldes,
at det ikke er blevet revideret, da det blev lavet. Hvis det gik ned, blev
der &aelig;ndret noget - ellers ikke.
<p>&AElig;ndringsforslag: oprydning, centralisering og ensretning i m&aring;den
referencer bliver sat op p&aring;, evt. vha. faste init-operationer, som
kaldes fra mjolner.bet.
<p>Forslag til overordnet strukturering:
<p><img SRC="HML_ArkiForslag.jpg" height=419 width=398>
<br>(<a href="HML_ArkiForslag.pdf">pdf</a>, xml i samme fil som ovenfor)
<p>Der var enighed om, at en s&aring; overordnet &aelig;ndring m&aring;
vente til nogle af punkterne (under 1.) ovenfor er fuldf&oslash;rt.
<br>&nbsp;
<h4>
3. KFJ's sekvensdiagram over 'New fragment'</h4>
<img SRC="KFJ_newFragment.jpg" height=493 width=642>
<br>(<a href="KFJ_newFragment.pdf">pdf</a>, <a href="KFJ_newFragment.xml">xml</a>)
<p>FGC: SifApplication's updateBrowser-kald burde vel ordnes fra notifications
i stedet? Og Ymer burde v&aelig;re en observer p&aring; Group
<br>&nbsp;
<h4>
4. Opgaver til n&aelig;ste gang</h4>
KFJ arbejder videre med sit diagram
<br>HML kigger p&aring; om det er muligt at sl&aring; SifInterface og EditorEnv
sammen
<br>MEJ laver en liste med forslag til &aelig;ndringer i navngivning
<br>&nbsp;
</body>
</html>
