<!doctype html public "-//w3c//dtd html 4.0 transitional//en">
<html>
<head>
   <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
   <meta name="GENERATOR" content="Mozilla/4.76 [en] (X11; U; SunOS 5.8 sun4u) [Netscape]">
</head>
<body text="#000000" bgcolor="#90C2C3" link="#0000EE" vlink="#551A8B" alink="#FF0000">

<center>
<h1>
Betam&oslash;de om arkitektur af Mj&oslash;lnersystemet</h1></center>

<center><img SRC="../makesimple.jpg" NOSAVE height=42 width=91>
<br>Torsdag d.13.september 2001, kl.14.</center>

<p>
<hr WIDTH="100%">
<br>&nbsp;
<p>Til stede: ESS,FGC,SOSH,KFJ,HML,MBE,MEJ,KSJ
<br>Referent: MEJ
<p>Dato for n&aelig;ste m&oslash;de: Fredag d. 28. spetember 2001, kl.
12.15 - 14.
<br>Xml-filerne er bygget v.h.a. Ideogramic UML og kan redigeres hermed.
<p><a href="FlemmingVedTavle.jpg"><img SRC="FlemmingVedTavle_thumb.jpg" NOSAVE height=60 width=80></a>
<p>&nbsp;<a href="FlemmingVedTavle1.mov">FlemmingVedTavle1.mov</a>
<br>&nbsp;<a href="FlemmingVedTavle2.mov">FlemmingVedTavle2.mov</a>
<h3>
Referat</h3>

<h4>
1. &Oslash;nsker om afklaring</h4>

<ul>
<li>
MEJ: generelt overblik, menuer og evt. diskussion af forsimplinger</li>

<li>
FGC: opdatering af treeview (KFJ p&aring;tager sig opgaven)</li>

<li>
SOSH: interface mellem debugger og Mj&oslash;lner Tool</li>

<li>
KFJ: interface mellem guienv og Bifrost</li>

<li>
HML: interface mellem Mj&oslash;lner Tool og meta-programmeringssystemet</li>

<li>
MBE &amp; KSJ: overblik</li>
</ul>

<h4>
2. FGC-gennemgang af overordnet arkitektur</h4>
<img SRC="FGC_Mjolner.jpg" height=361 width=789>
<br>(<a href="FGC_Mjolner.pdf">pdf </a>, <a href="FGC_Mjolner.xml">xml</a>)
<p>Mytologiske navne, som del-applikationerne tidligere havde og nu fors&oslash;ges
erstattet med mere sigende navne:
<ul>
<li>
Sif = editor, som bruges i textEditMode</li>

<li>
Ymer = sourcebrowser, som bruges til at navigere i syntax-strukturen</li>

<li>
Freja = CASE-tool</li>

<li>
Frigg = GUI-editor</li>

<li>
Valhalla = debugger</li>

<li>
Lidskjalv = guienv</li>

<li>
Bifrost = grafik</li>

<li>
Yggdrasil = mps</li>
</ul>
I forbindelse med "ops&aelig;tning af menuer" opstod der en lille, principiel
diskussion om l&oslash;s eller fast kobling mellem del-applikationerne
og deres menuer. Det er meget besv&aelig;rligt at rette menuerne til i
nuv&aelig;rende opbygning, men der er gode arkitekturelle grunde til at
bevare de l&oslash;se koblinger for nemmere at kunne fjerne eller inds&aelig;tte
st&oslash;rre del-app. (FGC eksempel: Knight).
<br>&nbsp;
<h4>
3. ESS-gennemgang af Sif m.m.</h4>
ESS: form&aring;let er at starte med at lave en kortl&aelig;gning af arkitekturen,
som s&aring; kan bringe evt. kritikpunkter og medf&oslash;lgende &aelig;ndringsforslag
tilveje.
<p><img SRC="ESS_Editor.jpg" height=548 width=681>
<p>(<a href="ESS_Editor.pdf">pdf</a>, <a href="ESS_Editor.xml">xml</a>)
<p>Flg. er l&oslash;se noter, som forh&aring;bentlig kan bruges sammen
med de f&aelig;rdige UML-diagrammer til at skrive en informativ gennemgang
af Mj&oslash;lnerTools arkitektur.
<ul>
<li>
FragmentForms-kassen i Mj&oslash;lnerTools hovedvindue er et eksempel p&aring;
en GroupEditor.</li>

<li>
Vi har 1 GroupEditor for hver bet-fil i 'Recent', og vi har 1 CodeEditor
for hver FragmentForm, vi har haft &aring;bnet.</li>

<li>
CodeViewer pr&aelig;senterer et AST textuelt i en SifTextEditor (som er
en CodeTextEditor, som er en TextEditor af den gode gl.dags slags fra GUIenv).
BETA-indenteren, som MBE har lavet, ligger i CodeTextEditor (dvs. separat
fra SifTextEditor) og tilbyder s&aring;ledes BETA-uafh&aelig;ngige features,
der kan bruges hvis man vil lave en indenter til et andet sprog. Diskussion
af hvorvidt CodeTextEditor og SifTextEditor kan l&aelig;gges sammen for
simpelhed og overskuelighed endte uafgjort.</li>

<li>
CodeViewer har en ASTviewer, hvilket i virkeligheden blot er en prettyprinter.
KFJ foresl&aring;r at omd&oslash;be ASTviewer til PrettyPrinter.</li>

<li>
Man kan gruppere delene under Controller-Model-View, hvor view er varianterne
af TextEditor beskrevet ovenfor, Controller best&aring;r af CodeEditor,
CodeViewer og ASTviewer m.m. og Model best&aring;r af FragmentForm og FragmentGroup.</li>

<li>
Kritik af navngivning: SifTextEditor er jo egentlig en "viewer", men efternavnet
"viewer" bruges i model-delen!? Ang. erstatning af mytologiske navne: "Sif"
skal ogs&aring; fjernes.</li>

<li>
CodeViewer og CodeEditor (som arver fra CodeViewer) kan godt l&aelig;gges
sammen til een klasse, fordi man alligevel altid bruger CodeEditor</li>

<li>
YmerCallback er interfacet til alt hvad man kan med sourcebrowseren f.eks.
'at f&oslash;lge et link'; Sif siger til SourceBrowseren: "Find fil x og
pr&aelig;senter den, s&aring; ordner jeg resten". Navngivning: "Ymer" skal
fjernes/erstattes.</li>

<li>
Observere: GroupEditor har en FragmentGroupObserver, og CodeEditor har
en FragmentFormObserver, som begge arver fra Observer. Modellen implementerer
observere, der kan bruges af controller-delen.</li>

<li>
Samspillet mellem observers i Sif, GUI-editor og CASE-tool er vigtigt,
da de notificerer hinanden om events.</li>
</ul>

<h4>
4. "&Oslash;velser" til n&aelig;ste gang :-)</h4>
'Ideogramic'-UML-diagrammer krydscheckes med betakoden og kompletteres
inden n&aelig;ste m&oslash;de af HML og MEJ
<p>KFJ laver sekvensdiagram el. lign. for alle opdateringer af treeviews
ved f.eks. Insert Fragment Form
<br>&nbsp;
<br>&nbsp;
<br>&nbsp;
</body>
</html>
