<!doctype html public "-//w3c//dtd html 4.0 transitional//en">
<html>
<head>
   <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
   <meta name="GENERATOR" content="Mozilla/4.76 [en] (X11; U; SunOS 5.8 sun4u) [Netscape]">
</head>
<body text="#000000" bgcolor="#90C2C3" link="#0000EE" vlink="#551A8B" alink="#FF0000">

<center>
<h1>
Betam&oslash;de om arkitektur af Mj&oslash;lnersystemet</h1></center>

<center><img SRC="../makesimple.jpg" NOSAVE height=42 width=91>
<br>Torsdag d.25. oktober 2001, kl.14.15</center>

<p>
<hr WIDTH="100%">
<p>Til stede: ESS,KFJ,SSH,HML,MBE,MEJ,KSJ
<br>Referent: MEJ
<p>Dato for n&aelig;ste m&oslash;de: Torsdag d. 22 november 2001, kl. 14.15.
<br>&nbsp;
<h3>
Referat</h3>

<h4>
1. MEJ: Navngivning</h4>
Flg. forslag til &aelig;ndring i navngivningen blev gennemg&aring;et og
vedtaget. Ogs&aring; FGC har sagt god for &aelig;ndringen.
<p><img SRC="MEJ_MjolnerCentralArki2.jpg" NOSAVE height=426 width=778>
<p>(<a href="MEJ_MjolnerCentralArki2.pdf">pdf</a>, <a href="MEJ_MjolnerCentralArki2.xml">xml</a>)
<p>P&aring; application-niveau hedder klasserne -application eller -window;
<br>P&aring; interface-niveau hedder de -interface;
<br>Implemementationen af interfacet hedder -interfaceImpl.
<p>Sif omd&oslash;bes til Editor, Ymer til SourceBrowser eller kort: 'sb'.
<p>Sourcebrowser flyttes ind i SourceBrowserWindow, da det kun er af historiske
&aring;rsager, den ligger separat i sin egen fil. SourceBrowser indeholder
stort set kun gui-erkl&aelig;ringer, som alligevel implementeres i YmerSourceBrowser
(og denne ligger allerede i SourceBrowserWindow), s&aring; de kan ogs&aring;
kollapses til blot en enkelt klasse ved denne flytning.
<p>SifEditorEnv, som er et tomt pattern, kan desv&aelig;rre ikke umiddelbart
fjernes, da den tjener form&aring;let at undg&aring; en cykel i include-grafen.
<p>Ogs&aring; navne p&aring; variable/referencer skal opdateres:
<ul>
<li>
YmerBrowser -> theSourceBrowser</li>

<li>
BrowserCallback -> SbObserver</li>

<li>
MyCallback -> theSbObserver</li>
</ul>
samt sikkert mange flere.
<p>Diskussion om hvorvidt patternet 'Observer' i metaprogrammeringssystemet
b&oslash;r omd&oslash;bes til 'mpsObserver', n&aring;r vi pludselig ogs&aring;
kalder vores callback for en slags observer:
<br>MEJ,MBE &amp;KFJ: det er forvirrende - s&aring; kan man fejlagtigt
tro, at SbObserver har noget at g&oslash;re med (f.eks. burde arve fra)
Observer.
<br>ESS og HML: nej, man kan godt have flere patterns, der hedder det samme,
uden at det interfererer - de er jo ikke i samme scope.
<br>Konklusionen blev, at der ingen &aelig;ndringer skal ske i navngivning
af Observer.
<h4>
2. HML: Ymercall og SourceBrowserInterface.</h4>
SifBrowserWindowExt b&oslash;r kunne smeltes sammen med SifApplication,
men det er rarest at f&aring; styr p&aring; interfaces f&oslash;rst.
<p><img SRC="sifapplication.jpg" NOSAVE height=541 width=613>
<br>(<a href="sifapplication.pdf">pdf</a>, <a href="sifapplication.xml">xml</a>)
<br>&nbsp;
<p>I stedet for klasserne YmerCall og myCallback b&oslash;r dette sl&aring;s
sammen med YmerBrowserInterface. Problemet er bare, at YmerBrowserInterface
har en pointer 'cfe' (= Current Form Editor, synonym for Current Code Editor
af historiske &aring;rsager) til CodeEditor, hvorfor der vil opst&aring;
en cykel i include-grafen, hvis CodeEditor samtidig skal have en pointer
til YmerBrowserInterface. Midlertidig workaround (indtil der findes et
alternativ til, at YmerBrowserInterface har cfe): YmerBrowserInterface
(som jo kommer til at hedde SourceBrowserInterface) arver fra AbstractSourceBrowserInterface,
som er det, CodeEditor har en pointer til. Implementationen ligger stadig
i SourceBrowserInterfaceImpl.
<p><img SRC="ymercall.jpg" NOSAVE height=398 width=776>
<br>(<a href="ymercall.pdf">pdf</a>, <a href="ymercall.xml">xml</a>)
<p>&AElig;ndringerne blev vedtaget.
<br>&nbsp;
<h4>
3. Praktiske kommentarer</h4>
ESS: N&aring;r denne slags (gennemgribende) &aelig;ndringer foretages,
skal vi v&aelig;re sikre p&aring; at kunne 'trace' hvilke &aelig;ndringer
der er sket v.h.a. cvs. Derfor er det vigtigt at lade Mjolner prettyprinte
de p&aring;g&aelig;ldende filer og s&aring; committe dem INDEN disse store
&aelig;ndringer laves. Ellers kan man ikke diff'e sig frem til hvad man
&aelig;ndrede. Det er dog ikke alle directories, der helt er g&aring;et
over til Mjolner prettyprint i cvs-repositoryet; flg. (under r5.3) er OK
at committe Mjolner-prettyprint i (uden at "for-committe"):
<ul>
<li>
editor/</li>

<li>
sourcebrowser/</li>

<li>
mjolnertool/</li>

<li>
pretty/</li>

<li>
freja/</li>

<li>
gpp/</li>

<li>
designenv/</li>
</ul>
men i flg. skal man s&oslash;rge for, at filerne er committet med Mjolner-pretty
INDEN&nbsp;man retter, da ikke alle filer n&oslash;dvendigvis har v&aelig;ret
gennem denne proces.
<ul>
<li>
debugger/</li>

<li>
interfacebuilder/</li>
</ul>
ESS: Find/Replace i Mjolner kan bruges til at finde/erstatte ALLE forekomster
af et navn i eet hug. Brug dog f&oslash;rst Find og se om noget skal igennem
prettyprinter-skridtet f&oslash;r det kan committes.
<br>&nbsp;
<h4>
4. Arbejdsplan</h4>
1. fase: HML flytter rundt p&aring; YmerCall m.m.
<br>2. fase: MBE &amp; MEJ &aelig;ndrer generelt i navngivningen i Sif
og Ymer, samt l&aelig;gger SourceBrowser ind under SourceBrowserWindow.
<p>KFJ forts&aelig;tter med at kigge p&aring; gui-opdateringer ved 'New
Fragment'.
</body>
</html>
